## Descriptive Statistics
central tendency and dispersion using statistics package [link](https://data-flair.training/blogs/python-descriptive-statistics/) or pandas [link](https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/06_calculate_statistics.html)

In [1]:
import numpy as np
import pandas as pd
import statistics as st

### Mean()

In [2]:
arr=[1,2,3,5,7,9]
print(st.mean(arr))
print(np.mean(arr))
num = np.array(arr)
print(num.mean())

4.5
4.5
4.5

### Mode()
return the most common data

In [3]:
arr = ['A','B','b','B','A','B']
print(st.mode(arr))
df=pd.DataFrame(arr)
df.mode()

B

   0
0  B

## Pandas

In [4]:
# https://github.com/pandas-dev/pandas/blob/master/doc/data/titanic.csv
titanic = pd.read_csv("https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv")

In [5]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [7]:
print(titanic["Age"].mean()) # return a numpy.float64
print(titanic[["Age",'Fare']].mean()) # return a Pandas Series with column names being index

29.69911764705882
Age     29.699118
Fare    32.204208
dtype: float64

In [8]:
titanic[["Sex", "Age"]].groupby("Sex").mean() # DataFrameGroupBy - aggr_func -> Dataframe

              Age
Sex
female  27.915709
male    30.726645

In [9]:
titanic.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [10]:
titanic.groupby("Sex")["Age"].mean() # DataFrameGroupBy -["Age"] -> SeriesGroupBy - mean()-> Series

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [11]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean() # return a Series, same chain as above.

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [12]:
titanic.groupby(["Sex", "Pclass"])['Fare'].describe()

               count        mean        std      min       25%       50%  \
Sex    Pclass
female 1        94.0  106.125798  74.259988  25.9292  57.24480  82.66455
       2        76.0   21.970121  10.891796  10.5000  13.00000  22.00000
       3       144.0   16.118810  11.690314   6.7500   7.85420  12.47500
male   1       122.0   67.226127  77.548021   0.0000  27.72810  41.26250
       2       108.0   19.741782  14.922235   0.0000  12.33125  13.00000
       3       347.0   12.661633  11.681696   0.0000   7.75000   7.92500

                      75%       max
Sex    Pclass
female 1       134.500000  512.3292
       2        26.062500   65.0000
       3        20.221875   69.5500
male   1        78.459375  512.3292
       2        26.000000   73.5000
       3        10.008300   69.5500